fio-test/results/14_write/1024k-psync-3.out
job1: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 14 processes

job1: (groupid=0, jobs=14): err= 0: pid=4786: Mon Jul 29 14:06:14 2024
  write: IOPS=5872, BW=5872MiB/s (6157MB/s)(1178GiB/205416msec); 0 zone resets
    clat (usec): min=357, max=351750, avg=2326.70, stdev=1195.61
     lat (usec): min=389, max=351821, avg=2380.47, stdev=1196.72
    clat percentiles (usec):
     |  1.00th=[ 1893],  5.00th=[ 2008], 10.00th=[ 2057], 20.00th=[ 2114],
     | 30.00th=[ 2180], 40.00th=[ 2212], 50.00th=[ 2278], 60.00th=[ 2311],
     | 70.00th=[ 2376], 80.00th=[ 2474], 90.00th=[ 2606], 95.00th=[ 2737],
     | 99.00th=[ 3326], 99.50th=[ 4359], 99.90th=[ 5866], 99.95th=[ 6325],
     | 99.99th=[15401]
   bw (  MiB/s): min= 2194, max= 7306, per=100.00%, avg=5883.99, stdev=36.47, samples=5737
   iops        : min= 2194, max= 7306, avg=5882.73, stdev=36.47, samples=5737
  lat (usec)   : 500=0.03%, 750=0.05%, 1000=0.06%
  lat (msec)   : 2=4.65%, 4=94.49%, 10=0.68%, 20=0.03%, 50=0.01%
  lat (msec)   : 500=0.01%
  cpu          : usr=2.44%, sys=1.82%, ctx=1206304, majf=0, minf=238
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1206240,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5872MiB/s (6157MB/s), 5872MiB/s-5872MiB/s (6157MB/s-6157MB/s), io=1178GiB (1265GB), run=205416-205416msec

Disk stats (read/write):
    dm-0: ios=48/1206106, merge=0/0, ticks=12/2746612, in_queue=2746624, util=100.00%, aggrios=22/1206240, aggrmerge=0/0, aggrticks=2/138314, aggrin_queue=138316, aggrutil=100.00%
  nvme1n2: ios=26/1206240, merge=0/0, ticks=3/132355, in_queue=132357, util=100.00%
  nvme0n2: ios=36/1206240, merge=0/0, ticks=2/133794, in_queue=133796, util=100.00%
  nvme3n2: ios=18/1206240, merge=0/0, ticks=2/141023, in_queue=141025, util=100.00%
  nvme2n2: ios=20/1206240, merge=0/0, ticks=2/139975, in_queue=139977, util=100.00%
  nvme5n2: ios=12/1206240, merge=0/0, ticks=2/144425, in_queue=144427, util=100.00%