fio-test/results/14_write/32k-psync-1.out
job1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 14 processes

job1: (groupid=0, jobs=14): err= 0: pid=14133: Mon Jul 29 16:08:49 2024
  write: IOPS=25.7k, BW=802MiB/s (841MB/s)(1178GiB/1503214msec); 0 zone resets
    clat (usec): min=52, max=10288, avg=498.45, stdev=265.26
     lat (usec): min=53, max=10290, avg=500.24, stdev=265.55
    clat percentiles (usec):
     |  1.00th=[  116],  5.00th=[  249], 10.00th=[  289], 20.00th=[  326],
     | 30.00th=[  367], 40.00th=[  429], 50.00th=[  474], 60.00th=[  506],
     | 70.00th=[  545], 80.00th=[  594], 90.00th=[  693], 95.00th=[  865],
     | 99.00th=[ 1549], 99.50th=[ 1958], 99.90th=[ 2868], 99.95th=[ 3523],
     | 99.99th=[ 5080]
   bw (  KiB/s): min=360768, max=2059328, per=100.00%, avg=890768.52, stdev=24026.90, samples=38873
   iops        : min=11274, max=64353, avg=27833.82, stdev=750.81, samples=38873
  lat (usec)   : 100=0.58%, 250=4.51%, 500=53.28%, 750=34.10%, 1000=3.68%
  lat (msec)   : 2=3.37%, 4=0.44%, 10=0.03%, 20=0.01%
  cpu          : usr=1.91%, sys=4.44%, ctx=38600241, majf=1, minf=687
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,38599680,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=802MiB/s (841MB/s), 802MiB/s-802MiB/s (841MB/s-841MB/s), io=1178GiB (1265GB), run=1503214-1503214msec

Disk stats (read/write):
    dm-0: ios=48/38598481, merge=0/0, ticks=4/18235260, in_queue=18235264, util=100.00%, aggrios=22/15442640, aggrmerge=0/0, aggrticks=1/1003015, aggrin_queue=1003017, aggrutil=100.00%
  nvme1n2: ios=26/15442603, merge=0/0, ticks=2/1067800, in_queue=1067802, util=100.00%
  nvme0n2: ios=36/15442671, merge=0/0, ticks=2/847967, in_queue=847968, util=100.00%
  nvme3n2: ios=18/15442597, merge=0/0, ticks=2/1040081, in_queue=1040083, util=100.00%
  nvme2n2: ios=20/15442658, merge=0/0, ticks=2/1043578, in_queue=1043580, util=100.00%
  nvme5n2: ios=12/15442674, merge=0/0, ticks=1/1015653, in_queue=1015654, util=100.00%